Merge branch 'main' into fix/408-emma-support
